renesas/ra-fsp-examples/application_projects/r01an8166/Renesas_RA_Family_Modbus_Sample_Program_Package/Modbus_Serial/project/EK-RA8T2/RA_Modbus/src/modbus_user.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2025 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : modbus_user.c
 * Version      : 1.0
 * Description  : This file implements the Read / Write functions and their function tables corresponding 
 *                to each address of the Coils / Discretes input / Holding registers / Input register.
 *********************************************************************************************************************/

/*============================================================================*/
/* I N C L U D E                                                              */
/*============================================================================*/
#include "r_modbus_typedef.h"
#include <stdint.h>
#include "hal_data.h"

/*============================================================================*/
/* E X T E R N                                                                */
/*============================================================================*/
/* definition in board_leds.c in FSP */
extern bsp_leds_t g_bsp_leds;

/*============================================================================*/
/* D E F I N E                                                                */
/*============================================================================*/
#define MB_MAXIMUM_DATA_VALUE            (10)

    #define MB_SW1            (BSP_IO_PORT_00_PIN_09)
    #define MB_SW2            (BSP_IO_PORT_00_PIN_08)

/*============================================================================*/
/* S T A T I C   F U N C T I O N   P R O T O T Y P E                          */
/*============================================================================*/
/* function for address error */
static modbus_err_t mb_reg_exp_addr_p8 (uint8_t * data);
static modbus_err_t mb_reg_exp_addr_p16 (uint16_t * data);
static modbus_err_t mb_reg_exp_addr_16 (uint16_t data);

/************************************************
 READ_COILS(0x01) functions
 */
static modbus_err_t mb_coil_read_00001 (uint8_t * data);
static modbus_err_t mb_coil_read_00002 (uint8_t * data);
static modbus_err_t mb_coil_read_00003 (uint8_t * data);
static modbus_err_t mb_coil_read_00004 (uint8_t * data);
static modbus_err_t mb_coil_read_00005 (uint8_t * data);
static modbus_err_t mb_coil_read_00006 (uint8_t * data);
static modbus_err_t mb_coil_read_00007 (uint8_t * data);
static modbus_err_t mb_coil_read_00008 (uint8_t * data);

/************************************************
 WRITE_SINGLE_COIL(0x05) functions
 */
static modbus_err_t mb_coil_write_00001 (uint8_t data);
static modbus_err_t mb_coil_write_00002 (uint8_t data);
static modbus_err_t mb_coil_write_00003 (uint8_t data);
static modbus_err_t mb_coil_write_00004 (uint8_t data);
static modbus_err_t mb_coil_write_00005 (uint8_t data);
static modbus_err_t mb_coil_write_00006 (uint8_t data);
static modbus_err_t mb_coil_write_00007 (uint8_t data);
static modbus_err_t mb_coil_write_00008 (uint8_t data);

/************************************************
 READ DISCRETE INPUTS(0x02) functions
 */
static modbus_err_t mb_d_read_10001 (uint8_t * data);
static modbus_err_t mb_d_read_10002 (uint8_t * data);
static modbus_err_t mb_d_read_10003 (uint8_t * data);
static modbus_err_t mb_d_read_10004 (uint8_t * data);
static modbus_err_t mb_d_read_10005 (uint8_t * data);
static modbus_err_t mb_d_read_10006 (uint8_t * data);
static modbus_err_t mb_d_read_10007 (uint8_t * data);
static modbus_err_t mb_d_read_10008 (uint8_t * data);
static modbus_err_t mb_d_read_10009 (uint8_t * data);

/* Generate exception at 10010 by MB_Reg_Exp_Addr() */

static modbus_err_t mb_d_read_10011 (uint8_t * data);
static modbus_err_t mb_d_read_10012 (uint8_t * data);

/************************************************
 READ_INPUT_REGISTERS(0x04) functions
 */
static modbus_err_t mb_ireg_read_30001 (uint16_t * data);
static modbus_err_t mb_ireg_read_30002 (uint16_t * data);
static modbus_err_t mb_ireg_read_30003 (uint16_t * data);

/* Generate exception at 30004 by MB_Reg_Exp_Addr() */
/* Generate exception at 30005 by MB_Reg_Exp_Addr() */
/* Generate exception at 30006 by MB_Reg_Exp_Addr() */
/* Generate exception at 30007 by MB_Reg_Exp_Addr() */

static modbus_err_t mb_ireg_read_30008 (uint16_t * data);

/************************************************
 READ_HOLDING_REGISTERS(0x03) functions
 */
static modbus_err_t mb_reg_read_40001 (uint16_t * data);
static modbus_err_t mb_reg_read_40002 (uint16_t * data);
static modbus_err_t mb_reg_read_40003 (uint16_t * data);

/* Generate exception at 40004 by MB_Reg_Exp_Addr() */
/* Generate exception at 40005 by MB_Reg_Exp_Addr() */
/* Generate exception at 40006 by MB_Reg_Exp_Addr() */

static modbus_err_t mb_reg_read_40007 (uint16_t * data);

/************************************************
 WRITE_SINGLE_REGISTER(0x06) functions
 */
static modbus_err_t mb_reg_write_40001 (uint16_t data);
static modbus_err_t mb_reg_write_40002 (uint16_t data);
static modbus_err_t mb_reg_write_40003 (uint16_t data);

/* Generate exception at 40004 by MB_Reg_Exp_Addr() */
/* Generate exception at 40005 by MB_Reg_Exp_Addr() */
/* Generate exception at 40006 by MB_Reg_Exp_Addr()*/

static modbus_err_t mb_reg_write_40007 (uint16_t data);

