renesas/ra-fsp-examples/application_projects/r01an8166/Renesas_RA_Family_Modbus_Sample_Program_Package/Modbus_Serial/project/EK-RA8T2/RA_Modbus/src/modbus_user.c
/*============================================================================*/
/* V A R I A B L E                                                            */
/*============================================================================*/

/************************************************
 READ_COILS(0x01) functions
 */
modbus_err_t (*MB_Coils_Read[])(uint8_t *data)=
{
    mb_coil_read_00001, /* 00001 */
    mb_coil_read_00002, /* 00002 */
    mb_coil_read_00003, /* 00003 */
    mb_coil_read_00004, /* 00004 */
    mb_coil_read_00005, /* 00005 */
    mb_coil_read_00006, /* 00006 */
    mb_coil_read_00007, /* 00007 */
    mb_coil_read_00008, /* 00008 */
};

/************************************************
 WRITE_SINGLE_COIL(0x05) functions
 */
modbus_err_t (*MB_Coils_Write[])(uint8_t data)=
{
    mb_coil_write_00001, /* 00001 */
    mb_coil_write_00002, /* 00002 */
    mb_coil_write_00003, /* 00003 */
    mb_coil_write_00004, /* 00004 */
    mb_coil_write_00005, /* 00005 */
    mb_coil_write_00006, /* 00006 */
    mb_coil_write_00007, /* 00007 */
    mb_coil_write_00008, /* 00008 */
};

/************************************************
 READ DISCRETE INPUTS(0x02) functions
 */
modbus_err_t (*MB_Discretes_Input[])(uint8_t *data)=
{
    mb_d_read_10001, /* 10001 */
    mb_d_read_10002, /* 10002 */
    mb_d_read_10003, /* 10003 */
    mb_d_read_10004, /* 10004 */
    mb_d_read_10005, /* 10005 */
    mb_d_read_10006, /* 10006 */
    mb_d_read_10007, /* 10007 */
    mb_d_read_10008, /* 10008 */
    mb_d_read_10009, /* 10009 */
    mb_reg_exp_addr_p8, /* 10010 */
    mb_d_read_10011, /* 10011 */
    mb_d_read_10012, /* 10012 */
};

/************************************************
 READ_INPUT_REGISTERS(0x04) functions
 */
modbus_err_t (*MB_Input_Regs[])(uint16_t *data)=
{
    mb_ireg_read_30001, /* 30001 */
    mb_ireg_read_30002, /* 30002 */
    mb_ireg_read_30003, /* 30003 */
    mb_reg_exp_addr_p16, /* 30004 */
    mb_reg_exp_addr_p16, /* 30005 */
    mb_reg_exp_addr_p16, /* 30006 */
    mb_reg_exp_addr_p16, /* 30007 */
    mb_ireg_read_30008, /* 30008 */
};

/************************************************
 READ_HOLDING_REGISTERS(0x03) functions
 */
modbus_err_t (*MB_HoldingRegs_Read[])(uint16_t *data)=
{
    mb_reg_read_40001, /* 40001 */
    mb_reg_read_40002, /* 40002 */
    mb_reg_read_40003, /* 40003 */
    mb_reg_exp_addr_p16, /* 40004 */
    mb_reg_exp_addr_p16, /* 40005 */
    mb_reg_exp_addr_p16, /* 40006 */
    mb_reg_read_40007, /* 40007 */
};

/************************************************
 WRITE_SINGLE_REGISTER(0x06) functions
 */
modbus_err_t (*MB_HoldingRegs_Write[])(uint16_t data)=
{
    mb_reg_write_40001, /* 40001 */
    mb_reg_write_40002, /* 40002 */
    mb_reg_write_40003, /* 40003 */
    mb_reg_exp_addr_16, /* 40004 */
    mb_reg_exp_addr_16, /* 40005 */
    mb_reg_exp_addr_16, /* 40006 */
    mb_reg_write_40007 /* 40007 */
};

/* Modbus coil address 00001 to 09999*/
uint8_t g_coils_area[] =
{ 0, 0, 0, 0, 0, 0, 0, 0 };
/* Modbus discrete input address 10001 to 19999*/
uint8_t g_discrete_input_area[] =
{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, };
/* Modbus input register address 30001 to 39999*/
uint16_t g_input_reg_area[] =
{ 0x0001, 0x0002, 0x0003, 0x0004, 0x0005, 0x0006, 0x0007, 0x00008 };
/* Modbus holding register address 40001 to 49999*/
uint16_t g_holding_reg_area[] =
{ 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF };

/* Number of coils */
uint32_t g_coil_end_addr           = (sizeof(MB_Coils_Read)) / (sizeof(MB_Coils_Read[0]));

/* Number of discrete inputs */
uint32_t g_discrete_input_end_addr = (sizeof(MB_Discretes_Input)) / (sizeof(MB_Discretes_Input[0]));

/* Number of input registers */
uint32_t g_input_reg_end_addr      = (sizeof(MB_Input_Regs)) / (sizeof(MB_Input_Regs[0]));

/* Number of holding registers */
uint32_t g_holding_reg_end_addr    = (sizeof(MB_HoldingRegs_Read)) / (sizeof(MB_HoldingRegs_Read[0]));

/*============================================================================*/
/* P R O G R A M                                                              */
/*============================================================================*/

/* MODBUS_ERR_ILLEGAL_DATA_ADDRESS is changed to ERR_SLAVE_DEVICE_FAILURE in MB_Func_Exp_Execution() */
/**********************************************************************************************************************
 * Function Name: mb_reg_exp_addr_p8
 * Description  : Returns MODBUS_ERR_ILLEGAL_DATA_ADDRESS
 * Argument     : uint8_t *data
 * Return Value : MODBUS_ERR_ILLEGAL_DATA_ADDRESS
 *********************************************************************************************************************/
static modbus_err_t mb_reg_exp_addr_p8(uint8_t *data)
{
    (void) data;
    return (MODBUS_ERR_ILLEGAL_DATA_ADDRESS);
}
/**********************************************************************************************************************
 End of function mb_reg_exp_addr_p8
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_reg_exp_addr_p16
 * Description  : Returns MODBUS_ERR_ILLEGAL_DATA_ADDRESS
 * Argument     : uint16_t *data
 * Return Value : MODBUS_ERR_ILLEGAL_DATA_ADDRESS
 *********************************************************************************************************************/
static modbus_err_t mb_reg_exp_addr_p16(uint16_t *data)
{
    (void) data;
    return (MODBUS_ERR_ILLEGAL_DATA_ADDRESS);
}
/**********************************************************************************************************************
 End of function mb_reg_exp_addr_p16
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_reg_exp_addr_16
 * Description  : Returns MODBUS_ERR_ILLEGAL_DATA_ADDRESS
 * Argument     : uint16_t data
 * Return Value : MODBUS_ERR_ILLEGAL_DATA_ADDRESS
 *********************************************************************************************************************/
static modbus_err_t mb_reg_exp_addr_16(uint16_t data)
{
    (void) data;
    return (MODBUS_ERR_ILLEGAL_DATA_ADDRESS);
}
/**********************************************************************************************************************
 End of function mb_reg_exp_addr_16
 *********************************************************************************************************************/

/************************************************
 READ_COILS(0x01) functions
 */
/**********************************************************************************************************************
 * Function Name: mb_coil_read_00001
 * Description  : Read Coil at address 00001
 * Argument     : uint8_t *coil
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_read_00001(uint8_t *coil)
{
    uint8_t index = 0;

    R_BSP_PinAccessEnable ();

