renesas/ra-fsp-examples/application_projects/r01an8166/Renesas_RA_Family_Modbus_Sample_Program_Package/Modbus_Serial/project/EK-RA8T2/RA_Modbus/src/modbus_user.c
    /* Cast the address of the target coil to a BSP enumeration type, 
     * and cast the read value of the target coil to within the appropriate range. */
    g_coils_area[index] = (uint8_t)R_BSP_PinRead ((bsp_io_port_pin_t)g_bsp_leds.p_leds[index]);
    R_BSP_PinAccessDisable ();
    *coil = g_coils_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_read_00001
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_read_00002
 * Description  : Read Coil at address 00002
 * Argument     : uint8_t *coil
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_read_00002(uint8_t *coil)
{
    uint8_t index = 1;

    R_BSP_PinAccessEnable ();

    /* Cast the address of the target coil to a BSP enumeration type, 
     * and cast the read value of the target coil to within the appropriate range. */
    g_coils_area[index] = (uint8_t)R_BSP_PinRead ((bsp_io_port_pin_t)g_bsp_leds.p_leds[index]);
    R_BSP_PinAccessDisable ();
    *coil = g_coils_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_read_00002
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_read_00003
 * Description  : Read Coil at address 00003
 * Argument     : uint8_t *coil
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_read_00003(uint8_t *coil)
{
    uint8_t index = 2;

    R_BSP_PinAccessEnable ();

    /* Cast the address of the target coil to a BSP enumeration type, 
     * and cast the read value of the target coil to within the appropriate range. */
    g_coils_area[index] = (uint8_t)R_BSP_PinRead ((bsp_io_port_pin_t)g_bsp_leds.p_leds[index]);
    R_BSP_PinAccessDisable ();
    *coil = g_coils_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_read_00003
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_read_00004
 * Description  : Read Coil at address 00004
 * Argument     : uint8_t *coil
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_read_00004(uint8_t *coil)
{
    uint8_t index = 3;

    *coil = g_coils_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_read_00004
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_read_00005
 * Description  : Read Coil at address 00005
 * Argument     : uint8_t *coil
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_read_00005(uint8_t *coil)
{
    uint8_t index = 4;

    *coil = g_coils_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_read_00005
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_read_00006
 * Description  : Read Coil at address 00006
 * Argument     : uint8_t *coil
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_read_00006(uint8_t *coil)
{
    uint8_t index = 5;

    *coil = g_coils_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_read_00006
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_read_00007
 * Description  : Read Coil at address 00007
 * Argument     : uint8_t *coil
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_read_00007(uint8_t *coil)
{
    uint8_t index = 6;

    *coil = g_coils_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_read_00007
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_read_00008
 * Description  : Read Coil at address 00008
 * Argument     : uint8_t *coil
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_read_00008(uint8_t *coil)
{
    uint8_t index = 7;

    *coil = g_coils_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_read_00008
 *********************************************************************************************************************/

/************************************************
 WRITE_SINGLE_COIL (0x05) functions
 */
/**********************************************************************************************************************
 * Function Name: mb_coil_write_00001
 * Description  : Write Coil at address 00001
 * Argument     : uint8_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_write_00001(uint8_t data)
{
    uint8_t index = 0;

