renesas/ra-fsp-examples/application_projects/r01an8166/Renesas_RA_Family_Modbus_Sample_Program_Package/Modbus_Serial/project/EK-RA8T2/RA_Modbus/src/modbus_user.c
    g_coils_area[index] = data & 0x01;
    R_BSP_PinAccessEnable ();

    /* Cast the target coil address and write value to the BSP enumeration type */
    R_BSP_PinWrite ((bsp_io_port_pin_t)g_bsp_leds.p_leds[index], (bsp_io_level_t)g_coils_area[index]);
    R_BSP_PinAccessDisable ();
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_write_00001
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_write_00002
 * Description  : Write Coil at address 00002
 * Argument     : uint8_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_write_00002(uint8_t data)
{
    uint8_t index = 1;

    g_coils_area[index] = data & 0x01;
    R_BSP_PinAccessEnable ();

    /* Cast the target coil address and write value to the BSP enumeration type */
    R_BSP_PinWrite ((bsp_io_port_pin_t)g_bsp_leds.p_leds[index], (bsp_io_level_t)g_coils_area[index]);
    R_BSP_PinAccessDisable ();
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_write_00002
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_write_00003
 * Description  : Write Coil at address 00003
 * Argument     : uint8_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_write_00003(uint8_t data)
{
    uint8_t index = 2;

    g_coils_area[index] = data & 0x01;
    R_BSP_PinAccessEnable ();

    /* Cast the target coil address and write value to the BSP enumeration type */
    R_BSP_PinWrite ((bsp_io_port_pin_t)g_bsp_leds.p_leds[index], (bsp_io_level_t)g_coils_area[index]);
    R_BSP_PinAccessDisable ();
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_write_00003
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_write_00004
 * Description  : Write Coil at address 00004
 * Argument     : uint8_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_write_00004(uint8_t data)
{
    uint8_t index = 3;

    g_coils_area[index] = data & 0x01;
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_write_00004
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_write_00005
 * Description  : Write Coil at address 00005
 * Argument     : uint8_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_write_00005(uint8_t data)
{
    uint8_t index = 4;

    g_coils_area[index] = data & 0x01;
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_write_00005
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_write_00006
 * Description  : Write Coil at address 00006
 * Argument     : uint8_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_write_00006(uint8_t data)
{
    uint8_t index = 5;

    g_coils_area[index] = data & 0x01;
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_write_00006
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_write_00007
 * Description  : Write Coil at address 00007
 * Argument     : uint8_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_write_00007(uint8_t data)
{
    uint8_t index = 6;

    g_coils_area[index] = data & 0x01;
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_write_00007
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_coil_write_00008
 * Description  : Write Coil at address 00008
 * Argument     : uint8_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_coil_write_00008(uint8_t data)
{
    uint8_t index = 7;

