renesas/ra-fsp-examples/application_projects/r01an8166/Renesas_RA_Family_Modbus_Sample_Program_Package/Modbus_Serial/project/EK-RA8T2/RA_Modbus/src/modbus_user.c
    g_coils_area[index] = data & 0x01;
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_coil_write_00008
 *********************************************************************************************************************/

/************************************************
 READ_DISCRETE_INPUTS (0x02) functions
 */
/**********************************************************************************************************************
 * Function Name: mb_d_read_10001
 * Description  : Read Discrete Inputs at address 10001
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10001(uint8_t *state)
{
    uint8_t index = 0;

    *state = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10001
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_d_read_10002
 * Description  : Read Discrete Inputs at address 10002
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10002(uint8_t *state)
{
    uint8_t index = 1;

    *state                       = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10002
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_d_read_10003
 * Description  : Read Discrete Inputs at address 10003
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10003(uint8_t *state)
{
    uint8_t index = 2;

    *state = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10003
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_d_read_10004
 * Description  : Read Discrete Inputs at address 10004
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10004(uint8_t *state)
{
    uint8_t index = 3;

    *state = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10004
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_d_read_10005
 * Description  : Read Discrete Inputs at address 10005
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10005(uint8_t *state)
{
    uint8_t index = 4;

    *state = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10005
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_d_read_10006
 * Description  : Read Discrete Inputs at address 10006
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10006(uint8_t *state)
{
    
    uint8_t  index = 5;

#ifndef BOARD_RA8T1_MCK
    uint32_t pin;
    R_BSP_PinAccessEnable ();

    /* Cast the address of the target coil to a BSP enumeration type */
    pin = R_BSP_PinRead ((bsp_io_port_pin_t)MB_SW1);
    R_BSP_PinAccessDisable ();

    /* Cast the read value of the target coil to within the appropriate range. */
    g_discrete_input_area[index] = (uint8_t) pin ^ 0x01;
#endif
    *state                       = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10006
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_d_read_10007
 * Description  : Read Discrete Inputs at address 10007
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10007(uint8_t *state)
{

    uint8_t  index = 6;

