renesas/ra-fsp-examples/application_projects/r01an8166/Renesas_RA_Family_Modbus_Sample_Program_Package/Modbus_Serial/project/EK-RA8T2/RA_Modbus/src/modbus_user.c
#ifndef BOARD_RA8T1_MCK
    uint32_t pin;
    R_BSP_PinAccessEnable ();

    /* Cast the address of the target coil to a BSP enumeration type */
    pin = R_BSP_PinRead ((bsp_io_port_pin_t)MB_SW2);
    R_BSP_PinAccessDisable ();

    /* Cast the read value of the target coil to within the appropriate range. */
    g_discrete_input_area[index] = (uint8_t) pin ^ 0x01;
#endif
    *state                       = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10007
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_d_read_10008
 * Description  : Read Discrete Inputs at address 10008
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10008(uint8_t *state)
{
    uint8_t index = 7;

    *state = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10008
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_d_read_10009
 * Description  : Read Discrete Inputs at address 10009
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10009(uint8_t *state)
{
    uint8_t index = 8;

    *state = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10009
 *********************************************************************************************************************/

/* Generate exception at 10010 by MB_Reg_Exp_Addr() */

/**********************************************************************************************************************
 * Function Name: mb_d_read_10011
 * Description  : Read Discrete Inputs at address 10011
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10011(uint8_t *state)
{
    uint8_t index = 10;

    *state = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10011
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_d_read_10012
 * Description  : Read Discrete Inputs at address 10012
 * Argument     : uint8_t *state
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_d_read_10012(uint8_t *state)
{
    uint8_t index = 11;

    *state = g_discrete_input_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_d_read_10012
 *********************************************************************************************************************/


/************************************************
 READ_INPUT_REGISTERS(0x04) functions
 */
/**********************************************************************************************************************
 * Function Name: mb_ireg_read_30001
 * Description  : Read Input Register at address 30001
 * Argument     : uint16_t *data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_ireg_read_30001(uint16_t *data)
{
    uint8_t index = 0;

    *data = g_input_reg_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_ireg_read_30001
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_ireg_read_30002
 * Description  : Read Input Register at address 30002
 * Argument     : uint16_t *data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_ireg_read_30002(uint16_t *data)
{
    uint8_t index = 1;

    *data = g_input_reg_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_ireg_read_30002
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_ireg_read_30003
 * Description  : Read Input Register at address 30003
 * Argument     : uint16_t *data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_ireg_read_30003(uint16_t *data)
{
    uint8_t index = 2;

