renesas/ra-fsp-examples/application_projects/r01an8166/Renesas_RA_Family_Modbus_Sample_Program_Package/Modbus_Serial/project/EK-RA8T2/RA_Modbus/src/modbus_user.c
    *data = g_input_reg_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_ireg_read_30003
 *********************************************************************************************************************/

/* Generate exception at 30004 by MB_Reg_Exp_Addr() */
/* Generate exception at 30005 by MB_Reg_Exp_Addr() */
/* Generate exception at 30006 by MB_Reg_Exp_Addr() */
/* Generate exception at 30007 by MB_Reg_Exp_Addr() */

/**********************************************************************************************************************
 * Function Name: mb_ireg_read_30008
 * Description  : Read Input Register at address 30008
 * Argument     : uint16_t *data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_ireg_read_30008(uint16_t *data)
{
    uint8_t index = 7;

    *data = g_input_reg_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_ireg_read_30008
 *********************************************************************************************************************/

/************************************************
 READ_HOLDING_REGISTERS(0x03) functions
 */
/**********************************************************************************************************************
 * Function Name: mb_reg_read_40001
 * Description  : Read Holding Register at address 40001
 * Argument     : uint16_t *data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_reg_read_40001(uint16_t *data)
{
    uint8_t index = 0;

    *data = g_holding_reg_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_reg_read_40001
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_reg_read_40002
 * Description  : Read Holding Register at address 40002
 * Argument     : uint16_t *data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_reg_read_40002(uint16_t *data)
{
    uint8_t index = 1;

    *data = g_holding_reg_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_reg_read_40002
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_reg_read_40003
 * Description  : Read Holding Register at address 40003
 * Argument     : uint16_t *data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_reg_read_40003(uint16_t *data)
{
    uint8_t index = 2;

    *data = g_holding_reg_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_reg_read_40003
 *********************************************************************************************************************/

/* Generate exception at 40004 by MB_Reg_Exp_Addr() */
/* Generate exception at 40005 by MB_Reg_Exp_Addr() */
/* Generate exception at 40006 by MB_Reg_Exp_Addr() */

/**********************************************************************************************************************
 * Function Name: mb_reg_read_40007
 * Description  : Read Holding Register at address 40007
 * Argument     : uint16_t *data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_reg_read_40007(uint16_t *data)
{
    uint8_t index = 6;

    *data = g_holding_reg_area[index];
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_reg_read_40007
 *********************************************************************************************************************/

/************************************************
 WRITE_SINGLE_REGISTER(0x06) functions
 */
/**********************************************************************************************************************
 * Function Name: mb_reg_write_40001
 * Description  : Write Holding Register at address 40001
 * Argument     : uint16_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_reg_write_40001(uint16_t data)
{
    uint8_t index = 0;

    g_holding_reg_area[index] = data;
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_reg_write_40001
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_reg_write_40002
 * Description  : Write Holding Register at address 40002
 * Argument     : uint16_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_reg_write_40002(uint16_t data)
{
    uint8_t index = 1;

    g_holding_reg_area[index] = data;
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_reg_write_40002
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: mb_reg_write_40003
 * Description  : Write Holding Register at address 40003
 * Argument     : uint16_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
/* ERR_ILEEGAL_DATA_VALUE is changed to ERR_SLAVE_DEVICE_FAILURE in MB_Func_Exp_Execution() */
static modbus_err_t mb_reg_write_40003(uint16_t data)
{
    uint8_t index = 2;

    if (data > MB_MAXIMUM_DATA_VALUE)
    {
        return (MODBUS_ERR_ILLEGAL_DATA_VALUE);
    }
    g_holding_reg_area[index] = data;
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_reg_write_40003
 *********************************************************************************************************************/

/* Generate exception at 40004 by MB_Reg_Exp_Addr() */
/* Generate exception at 40005 by MB_Reg_Exp_Addr() */
/* Generate exception at 40006 by MB_Reg_Exp_Addr() */

/**********************************************************************************************************************
 * Function Name: mb_reg_write_40007
 * Description  : Write Holding Register at address 40007
 * Argument     : uint16_t data
 * Return Value : MODBUS_ERR_OK
 *********************************************************************************************************************/
static modbus_err_t mb_reg_write_40007(uint16_t data)
{
    uint8_t index = 6;

    g_holding_reg_area[index] = data;
    return (MODBUS_ERR_OK);
}
/**********************************************************************************************************************
 End of function mb_reg_write_40007
 *********************************************************************************************************************/

/* End of File */
